[{"url": "https://www.channelnewsasia.com/business/indias-paytm-september-quarter-net-loss-widens-2342201", "section": "Business", "section_url": "/category/business", "title": "India's Paytm September quarter net loss widens", "image": "https://onecms-res.cloudinary.com/image/upload/v1637990654/one-cms/core/2021-11-27t052256z_1_lynxmpehaq023_rtroptp_3_paytm-ipo-india.jpg", "author": null, "published_time": "2021-11-27 13:24:00", "updated_time": "2021-11-27 13:30:09", "body": "NEW DELHI: India's One 97 Communications, the parent of fintech firm Paytm, said on Saturday (Nov 27) its net loss for the three months through September widened by 8.4 per cent as expenses rose. Paytm, reporting its earnings publicly for the first time since listing this month, reported a consolidated net loss of 4.74 billion rupees (US$63.2 million) compared with 4.37 billion rupees in the same period a year earlier. Revenue rose 49.7 per cent to 11.35 billion rupees. \"We have maintained the growth momentum in our payments services business, expanded our financial services business aggressively and are on our way to pre-COVID volumes for Commerce and Cloud services,\" Paytm's management said in a statement, adding that the company was well funded. Paytm counts China's Ant Group and Japan's SoftBank Group among its backers. It raised US$2.5 billion in what was India's biggest initial public offering (IPO) this month, but made a dismal debut on the stock exchanges last week. The stock has since recouped some of the losses but is still down 17 per cent from its issue price of 2,150 rupees. Market analysts have questioned the company's business model and lack of visibility to turn profitable. Paytm's founder and chief executive, Vijay Shekhar Sharma, has said investors will need time to understand the company's business. Paytm, founded by Sharma in 2010, began as a platform for adding credit to mobile phones and grew rapidly after US ride-hailing firm Uber Technologies Inc listed it as a quick payment option in India. Its use jumped in 2016 when India's shock ban on high-value currency notes boosted digital payments. The company, headquartered on the outskirts of capital New Delhi, offers services including merchant payments, insurance and gold sales, movie and flight ticketing, and bank deposits and remittance."}]