[{"url": "https://www.cnbc.com/2021/01/01/seinfeld-meditation-and-weight-training.html", "section": "Health Tips and Wellness Advice", "section_url": "", "title": "Jerry Seinfeld: Transcendental Meditation and weight training will 'solve just about anyone's life'", "author": "https://www.facebook.com/CNBC", "published_time": "2021-01-01T14:30:01+0000", "updated_time": "2021-01-01T14:30:01+0000", "image": "https://image.cnbcfm.com/api/v1/image/103316508-GettyImages-502234580-2.jpg?v=1608582844", "body": "Comedian Jerry Seinfeld believes there are just two healthy habits that \"could solve just about anyone's life\": Transcendental Meditation and weight training, he said during a recent episode of the podcast, \"\n\n.\"\n\nSeinfeld, 66, explained that incorporating these techniques into his routine have \n\n, focused and creative throughout his career. Here's what you need to know about weight training and Transcendental Meditation:\n\nTranscendental Meditation (or TM) is a proprietary form of meditation that requires sitting for 20 minutes twice a day and repeating a mantra. (TM is taught by certified instructors and \n\n on a sliding scale.)\n\nOprah Winfrey, hedgefund billionaire \n\n and even singer Lady Gaga are \n\n, and credit much of their success and productivity to the practice.\n\nSeinfeld agrees, calling TM \"the absolutely ultimate work tool.\"\n\nSo, what makes this type of meditation so special? Practicing TM \"allows the active thinking mind to just, all of it to just settle down, and experience quieter levels of thought,\" \n\n, TM instructor and CEO of The David Lynch Foundation, said in a 2014 YouTube \n\n.\n\nAccording to Seinfeld, TM helps to reduce stress and increase energy and focus. \"As a standup comic, I can tell you, my entire life is concentration fatigue,\" he said. \"Whether it's writing or performing, my brain and my body, which is the same thing, are constantly hitting the wall. And if you have [TM] in your hip pocket, you're Columbus with a compass.\"\n\nSeinfeld practices TM twice a day or \"any time I feel like I'm dipping,\" he said. For example, if he isn't feeling inspired during a writing session, he will meditate. \"If I sit down and the pen doesn't move for like 20 minutes, I know I'm out of gas,\" he said.\n\nSeinfeld's workout routine includes a mix of lifting weights for an hour and interval cardio training three times a week.\n\nSeinfeld initially got into weight training by doing \n\n, a 12-week diet and exercise regimen that includes exercising six times a week (three days for lifting weights and three days of high-intensity interval training) and eating six small meals a day. Now exercise is a crucial part of his daily routine.\n\n\"There are a lot of days where I want to cry instead of do it because it really physically hurts,\" Seinfeld said. \"But I just think it's very balancing to the forces inside humanity that I think are just, they overwhelm us.\"\n\nThere's some science to this healthy habit: Studies have shown that \n\n (exercises that strengthen your muscles using external resistance, like free weights, machines or your own bodyweight) can relieve symptoms of anxiety.\n\nThe \n\n suggest that adults get 150-300 minutes a week (or 20-45 minutes a day) of moderate-intensity activity, or 75-150 minutes a week (or 10 to 20 minutes a day) of vigorous-intensity aerobic physical activity. "},{"url": "https://www.cnbc.com/2021/01/01/its-now-easier-for-your-boss-to-pay-off-your-student-loans-.html", "section": "Personal Finance", "section_url": "", "title": "Coronavirus relief bill makes it easier for companies to pay down workers' student loans", "author": "https://www.facebook.com/CNBC", "published_time": "2021-01-01T14:45:01+0000", "updated_time": "2021-01-01T14:45:01+0000", "image": "https://image.cnbcfm.com/api/v1/image/106676069-1598289739541-gettyimages-1223427521-graduationcelebration.jpeg?v=1609429366", "body": "Student loan assistance, which started as a niche offering by a handful of companies, was already finding its way into the mainstream menu of workplace benefits before Covid hit.\n\nThe pandemic may only accelerate the trend.\n\nPrior to the crisis, around 1 in 10 employers offered a student loan benefit, according to a 2019 survey by The Society for Human Resource Management. The share of companies that would do so could rise to 1 in 3, the organization found, if the government allowed them to avoid taxes on the payments.\n\nIn the $2.2 trillion federal CARES Act passed in March, it did just that. Although the tax-incentive was set to expire at the end of 2020, the latest relief package extends the provision for another five years. And experts say it's likely to become permanent.\n\nMany workers could use the assistance.\n\nEach year, 70% of college graduates start off their lives in the red, and the average balance has climbed to $30,000, from $10,000 in the early 1990s. The typical monthly student loan payment is $400. \n\nHere are the details of the benefit and what the new rules mean.\n\nUnder the new provision, employers may make tax-free contributions of up to $5,250 a year to their employees' education debt. The payments are not included in the employees' taxable income.\n\nUntil at least Dec. 31, 2025.\n\nCompanies that offer student loan assistance pay your lender directly. The typical benefit is around $100 a month, said higher education expert Mark Kantrowitz.\n\nThe U.S. Department of Education allowed borrowers to not make payments on their federal student loans through the end of 2020, without interest accruing on their debt. Advocates hope President-elect Joe Biden will extend the reprieve beyond April.\n\nIn the meantime, your employer can still make payments on your student loans. Since interest is suspended, the money will just go directly to your debt's principal.\n\nAmid the crisis, employers have been furloughing and laying off workers, and \n\n. That may not sound like a good environment for them to be keeping — led alone adding — a new benefit like student loan assistance.\n\nBut Kantrowitz said he hasn't heard of any companies getting rid of the program of late.\n\n\"It's a relatively inexpensive benefit, and it's a good retention and recruiting tool for employers,\" he said.\n\nConsider asking someone in your company's human resources department to consider adding the benefit, Kantrowitz said. Point out that the latest stimulus package includes a tax incentive for them to do so.\n\n\"It's a way for the employer to show that they care about their employees' concerns,\" he said."}]